#ifndef _USER_CAL_POWER_H_
#define _USER_CAL_POWER_H_

#include "stdint.h"
/*******************************************************************************************************
 * @brief 根据阻力与rpm，计算出瞬时功率
 *
 * @note  NULL
 *
 * @param res_val：uint32_t 外部传入的阻力值
 * 
 * @param rpm_val：uint32_t 外部传入的RPM值
 *
 * @return int32_t 单位为瓦特的瞬时功率值
 *******************************************************************************************************/
uint32_t CAL_power(uint32_t res_val, uint32_t rpm_val);
/*******************************************************************************************************
 * @brief 根据目标功率与rpm，反推出阻力档位
 *
 * @note  NULL
 *
 * @param target_power：uint32_t 外部传入的目标功率值
 * 
 * @param rpm_val：uint32_t 外部传入的目标RPM值
 *
 * @return uint32_t 0-100的阻力档位
 *******************************************************************************************************/
uint32_t get_CAL_target_res(uint32_t target_power, uint32_t rpm_val);
/*******************************************************************************************************
 * @brief 初始化功率，会从NVS读取型号区别功率
 *
 * @note  NULL
 *
 * @param void
 *
 * @return void
 *******************************************************************************************************/
void CAL_power_init(void);

#endif